Revit 2026 API

# MultiReferenceAnnotationOptionsSetElementsToDimension Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetElementsToDimension(
	ICollection<ElementId> elementsToDimension
)
```
```vb
Public Sub SetElementsToDimension (
	elementsToDimension As ICollection(Of ElementId)
)
```
```cpp
public:
void SetElementsToDimension(
	ICollection<ElementId^>^ elementsToDimension
)
```
```fsharp
member SetElementsToDimension :
        elementsToDimension : ICollection<ElementId> -> unit
```

#### Parameters

elementsToDimension ICollectionElementId

#### Reference

MultiReferenceAnnotationOptions Class

Autodesk.Revit.DB Namespace